chixi4/Band-0/sdk/updater/sdkconfig.defaults
# ESP32-C2 / ESP8684 — Updater App
CONFIG_IDF_TARGET="esp32c2"
CONFIG_IDF_TARGET_ESP32C2=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_60M=y

# Partition table (same CSV as main, but updater doesn't use it directly)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=100

# Keep the updater small: it is local-only and accepts http:// OTA URLs.
# The main app can still run richer diagnostics and BLE.

# Compiler size
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=0

# Wi-Fi STA only, no enterprise/TLS stack in the updater.
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set

# NVS
CONFIG_NVS_ENCRYPTION=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# Minimal memory config
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
